Repository: bounswe/bounswe2025group6
Catalog: mobile/lib/l10n/app_*.arb
Languages: tr

# failedToLoadMealPlanner
source: Failed to load meal planner: {error}
tr: Yemek planlayıcı yüklenemedi: {error}

# mealPlannerError
source: An error occurred while loading the meal planner.
tr: Yemek planlayıcı yüklenirken bir hata oluştu.

# shoppingListShared
source: Shopping list shared successfully!
tr: Alışveriş listesi başarıyla paylaşıldı!

source: Failed to share shopping list
tr: Alışveriş listesi paylaşılamadı

source: Validation Error
tr: Doğrulama Hatası

# fixValidationErrors
source: Please fix the validation errors in the form before applying filters.
tr: Filtreleri uygulamadan önce lütfen formdaki doğrulama hatalarını düzeltin.

# validationCheckList
source: Check that: • All values are valid numbers • All values are positive • Min values are not greater than Max values
tr: Kontrol edin: • Tüm değerler geçerli sayılar olmalı • Tüm değerler pozitif olmalı • Min değerler Maks değerlerden büyük olmamalı

source: Invalid number
tr: Geçersiz sayı

source: Must be positive
tr: Pozitif olmalı

# minGreaterThanMax
source: Min > Max
tr: Min > Maks

# maxLessThanMin
source: Max < Min
tr: Maks < Min

source: OK
tr: Tamam
