Repository: bounswe/bounswe2025group6
Catalog: mobile/lib/l10n/app_*.arb
Languages: tr

source: Hello World!
tr: Merhaba Dünya

# dashboardSubtitle
source: Manage your meals, recipes, and plans here.
tr: Yemeklerinizi, tariflerinizi ve planlarınızı burada yönetin.

source: Discover Recipes
tr: Tarifleri Keşfet

source: Upload Recipe
tr: Tarif Yükle

source: Join Community
tr: Topluluğa Katıl

# planMeal
source: Plan a Meal
tr: Öğün Planlayıcı

source: Logout
tr: Çıkış Yap

# logoutConfirmation
source: Are you sure you want to logout?
tr: Çıkış yapmak istediğinizden emin misiniz?

# logoutFailed
source: Logout failed: {error}
tr: Çıkış başarısız: {error}

source: Cancel
tr: İptal

source: Home
tr: Ana Sayfa

source: Community
tr: Topluluk

source: Profile
tr: Profil

source: Welcome back!
tr: Tekrar hoş geldiniz!

# discoverRecipesTitle
source: Discover Recipes
tr: Tarifleri Keşfet

source: Search Recipes
tr: Tariflerde Ara

# maxCost
source: Max Cost (e.g., 50.0)
tr: Maksimum Maliyet (ör. 50.0)

source: Dietary Options:
tr: Diyet Seçenekleri:

source: Sort By:
tr: Sırala:

# dietaryHighProtein
source: High-Protein
tr: Yüksek Protein

# dietaryLowCarbohydrate
source: Low-Carbohydrate
tr: Düşük Karbonhidrat

# dietaryVegetarian
source: Vegetarian
tr: Vejetaryen

# dietaryGlutenFree
source: Gluten-Free
tr: Gluten İçermez

# dietaryPescatarian
source: Pescatarian
tr: Pesketeryan

# sortName
source: Name
tr: Ad

# sortCost
source: Cost
tr: Maliyet

# sortTime
source: Time
tr: Süre

source: No recipes found.
tr: Hiç tarif bulunamadı.

# noRecipesMatchFilters
source: No recipes match your current filters.
tr: Seçilen filtrelere uyan tarif yok.

source: No recipes available.
tr: Hiç tarif yok.

# errorLoadingRecipes
source: Error: {error}
tr: Hata: {error}

# forgotPasswordTitle
source: Forgot Password
tr: Şifreyi Unuttum

# resetPasswordHeading
source: Reset Password
tr: Şifreyi Sıfırla

# resetPasswordDescription
source: Enter your email address and we will send you instructions to reset your password.
tr: E-posta adresinizi girin, şifrenizi sıfırlamak için talimatları size göndereceğiz.

# emailLabel
source: EMAIL
tr: E-POSTA

# pleaseEnterEmail
source: Please enter your email
tr: Lütfen e-posta adresinizi girin

# invalidEmail
source: Enter a valid email
tr: Geçerli bir e-posta girin

source: Send Reset Link
tr: Sıfırlama Bağlantısını Gönder

# passwordResetSent
source: Password reset code has been sent to your email
tr: Şifre sıfırlama kodu e-posta adresinize gönderildi

# loginTitle
source: Login
tr: Giriş

source: Sign in to continue
tr: Devam etmek için oturum açın

# passwordLabel
source: PASSWORD
tr: PAROLA

# pleaseEnterPassword
source: Please enter your password
tr: Lütfen parolanızı girin

# forgotPasswordQuestion
source: Forgot Password?
tr: Şifremi Unuttum?

# logInButton
source: Log In
tr: Giriş Yap

# dontHaveAccount
source: Don't have an account?
tr: Hesabınız yok mu?

source: Create Account
tr: Hesap Oluştur

source: Login successful!
tr: Giriş başarılı!

# loginFailed
source: Login failed: {message}
tr: Giriş başarısız: {message}

# tooManyLoginAttempts
source: Too many failed login attempts. Please try again later.
tr: Çok fazla başarısız giriş denemesi. Lütfen daha sonra tekrar deneyin.

# createNewPasswordTitle
source: Create New Password
tr: Yeni Parola Oluştur

# newPasswordLabel
source: New Password
tr: Yeni Parola

# confirmPasswordLabel
source: Confirm Password
tr: Parolayı Onayla

source: Password reset successful
tr: Parola sıfırlama başarılı

# passwordRequired
source: Password is required
tr: Parola gerekli

# passwordMinLength
source: Password must be at least 8 characters
tr: Parola en az 8 karakter olmalıdır

source: Passwords do not match
tr: Parolalar eşleşmiyor

source: Save Password
tr: Parolayı Kaydet

# profileTitle
source: Profile
tr: Profil

# myProfileTitle
source: My Profile
tr: Profilim

# profileSettingsTooltip
source: Profile Settings
tr: Profil Ayarları

source: Retry
tr: Tekrar Dene

# failedToLoadProfile
source: Failed to load profile: {error}
tr: Profil yüklenemedi: {error}

# failedToLoadRecipes
source: Failed to load recipes: {error}
tr: Tarifler yüklenemedi: {error}

# userIdNotAvailable
source: User ID not available to load recipes.
tr: Tarifleri yüklemek için kullanıcı kimliği mevcut değil.

# profileDataNotAvailable
source: Profile data is not available.
tr: Profil verileri mevcut değil.

# noUserRecipesYet
source: You haven't created any recipes yet.
tr: Henüz tarif oluşturmadınız.

source: Personal Information
tr: Kişisel Bilgiler

source: Preferences
tr: Tercihler

source: Activity Stats
tr: Aktivite İstatistikleri

source: Localization & Accessibility
tr: Yerelleştirme ve Erişilebilirlik

# communitySection
source: Community
tr: Topluluk

source: My Recipes
tr: Tariflerim

source: User Type
tr: Kullanıcı Türü

source: Profile Status
tr: Profil Durumu

source: Public
tr: Genel

source: Private
tr: Özel

# dietaryPreferencesLabel
source: Dietary Preferences
tr: Diyet Tercihleri

# allergensLabel
source: Allergens:
tr: Alerjenler:

# dislikedFoodsLabel
source: Disliked Foods
tr: Sevmediklerim

# monthlyBudgetLabel
source: Monthly Budget
tr: Aylık Bütçe

source: Not set
tr: Ayarlanmadı

source: Recipes Created
tr: Oluşturulan Tarifler

# avgRecipeRating
source: Average Recipe Rating
tr: Ortalama Tarif Puanı

source: Cooking Skill
tr: Pişirme Becerisi

# languageLabel
source: Language
tr: Dil

# dateFormatLabel
source: Date Format
tr: Tarih Formatı

# currencyLabel
source: Currency
tr: Para Birimi

# accessibilityLabel
source: Accessibility
tr: Erişilebilirlik

# nationalityLabel
source: Nationality
tr: Uyruk

# dateOfBirthLabel
source: Date of Birth
tr: Doğum Tarihi

# followingLabel
source: Following
tr: Takip Edilenler

# joinedLabel
source: Joined
tr: Katılım Tarihi

# bookmarkedRecipesLabel
source: Bookmarked Recipes
tr: Yer İşaretli Tarifler

# likedRecipesLabel
source: Liked Recipes
tr: Beğenilen Tarifler

source: users
tr: kullanıcı

source: recipes
tr: tarif

# profileSettingsTitle
source: Profile Settings
tr: Profil Ayarları

source: Settings saved!
tr: Ayarlar kaydedildi!

# failedToSaveSettings
source: Failed to save settings: {error}
tr: Ayarlar kaydedilemedi: {error}

# chooseAvatar
source: Choose Your Avatar:
tr: Avatarınızı Seçin:

# usernameLabel
source: Username
tr: Kullanıcı Adı

# usernameEmptyError
source: Enter at least 3 characters
tr: En az 3 karakter girin

# dislikedFoodsHint
source: Disliked Foods (comma separated)
tr: Sevmediklerim (virgülle ayırın)

# monthlyBudgetHint
source: Monthly Budget (Optional)
tr: Aylık Bütçe (Opsiyonel)

# publicProfileLabel
source: Public Profile
tr: Genel Profil

# preferredCurrencyLabel
source: Preferred Currency
tr: Tercih Edilen Para Birimi

# accessibilityNeedsLabel
source: Accessibility Needs
tr: Erişilebilirlik İhtiyaçları

source: Nationality (Optional)
tr: Uyruk (Opsiyonel)

source: Date of Birth (Optional)
tr: Doğum Tarihi (Opsiyonel)

# recipeDetailsTitle
source: Recipe Details
tr: Tarif Detayları

# ingredientsTitle
source: Ingredients
tr: Malzemeler

# noIngredients
source: No ingredients listed.
tr: Herhangi bir malzeme listelenmemiş.

# preparationStepsTitle
source: Preparation Steps
tr: Hazırlık Adımları

source: No steps provided.
tr: Herhangi bir adım sağlanmamış.

# costPerServingLabel
source: Cost per Serving:
tr: Porsiyon Başına Maliyet:

# difficultyLabel
source: Difficulty:
tr: Zorluk:

# tasteRatingLabel
source: Taste Rating
tr: Lezzet Puanı

# healthRatingLabel
source: Health Rating
tr: Sağlık Puanı

# likesLabel
source: Likes:
tr: Beğeniler:

# commentsLabel
source: Comments:
tr: Yorumlar:

# dietaryInfoLabel
source: Dietary Info:
tr: Diyet Bilgisi:

# prepTimeLabel
source: Prep Time
tr: Hazırlama Süresi

# cookTimeLabel
source: Cook Time
tr: Pişirme Süresi

# allergenPeanuts
source: Peanuts
tr: Yerfıstığı

# allergenDairy
source: Dairy
tr: Süt Ürünleri

# allergenSoy
source: Soy
tr: Soya

# allergenShellfish
source: Shellfish
tr: Kabuklu Deniz Ürünleri

# allergenTreeNuts
source: Tree Nuts
tr: Ağaç Kabuklu Kuruyemişler

# allergenWheat
source: Wheat
tr: Buğday

# registerTitle
source: Register
tr: Kayıt Ol

# createAccountHeading
source: Create Account
tr: Hesap Oluştur

# passwordHelper
source: Must contain 8+ characters, uppercase, lowercase, and number
tr: En az 8 karakter, büyük/küçük harf ve sayı içermelidir

# pleaseConfirmPassword
source: Please confirm your password
tr: Lütfen parolanızı onaylayın

# userTypeLabel
source: User Type
tr: Kullanıcı Türü

# uploadPdfButton
source: Upload PDF (Certificate)
tr: PDF Yükle (Sertifika)

# uploadedLabel
source: Uploaded
tr: Yüklendi

source: I accept the
tr: Kabul ediyorum

source: Terms and Conditions
tr: Hüküm ve Koşullar

# registerButton
source: Register
tr: Kayıt Ol

# uploadRecipeTitle
source: Upload New Recipe
tr: Yeni Tarif Yükle

# recipeNameLabel
source: Recipe Name
tr: Tarif Adı

# enterRecipeNameValidation
source: Please enter the recipe name
tr: Lütfen tarif adını girin

# preparationTimeLabel
source: Preparation Time (minutes)
tr: Hazırlama Süresi (dakika)

# enterPreparationTime
source: Please enter preparation time
tr: Lütfen hazırlama süresini girin

# enterValidNumber
source: Please enter a valid number
tr: Lütfen geçerli bir sayı girin

source: Time must be positive
tr: Süre pozitif olmalıdır

# cookingTimeLabel
source: Cooking Time (minutes)
tr: Pişirme Süresi (dakika)

# mealTypeLabel
source: Meal Type
tr: Öğün Türü

source: Breakfast
tr: Kahvaltı

source: Lunch
tr: Öğle

source: Dinner
tr: Akşam

# selectMealTypeValidation
source: Please select a meal type
tr: Lütfen bir öğün türü seçin

# stepsLabel
source: Steps
tr: Adımlar

# stepsHint
source: Enter each step on a new line...
tr: Her adımı yeni bir satırda girin...

# enterStepsValidation
source: Please enter the steps
tr: Lütfen adımları girin

# ingredientNameLabel
source: Ingredient Name
tr: Malzeme Adı

# enterIngredientNameValidation
source: Enter ingredient name
tr: Malzeme adını girin

source: No ingredients found.
tr: Herhangi bir malzeme bulunamadı.

# quantityLabel
source: Quantity
tr: Miktar

# enterQuantityValidation
source: Enter quantity
tr: Lütfen miktarı girin

# quantityPositiveValidation
source: Quantity must be positive
tr: Miktar pozitif olmalıdır

# unitLabel
source: Unit (e.g., pcs, cup)
tr: Birim (ör. adet, su bardağı)

# removeLabel
source: Remove
tr: Kaldır

# addIngredientLabel
source: Add Ingredient
tr: Malzeme Ekle

# uploadRecipeButton
source: Upload Recipe
tr: Tarifi Yükle

# recipeUploadedSuccess
source: Recipe uploaded successfully!
tr: Tarif başarıyla yüklendi!

source: Failed to upload recipe.
tr: Tarif yüklenemedi.

# failedToLoadIngredients
source: Failed to load ingredients: {error}
tr: Malzemeler yüklenemedi: {error}

# recipeUploadedButProfileCountFailed
source: Recipe uploaded, but failed to update profile count: {error}
tr: Tarif yüklendi, ama profil sayısı güncellenemedi: {error}

# genericError
source: Error: {error}
tr: Hata: {error}

# verifyCodeTitle
source: Verify Code
tr: Doğrulama Kodu

source: User
tr: Kullanıcı

source: Dietitian
tr: Diyetisyen

# verifyResetCodeHeading
source: Verify Reset Code
tr: Sıfırlama Kodunu Doğrula

# enter6DigitCodeSentTo
source: Enter the 6-digit code sent to {email}
tr: {email} adresine gönderilen 6 haneli kodu girin

# resetCodeLabel
source: Reset Code
tr: Sıfırlama Kodu

# pleaseEnterResetCode
source: Please enter the reset code
tr: Lütfen sıfırlama kodunu girin

# resetCode6Digits
source: Reset code must be 6 digits
tr: Sıfırlama kodu 6 haneli olmalıdır

# verifyCodeButton
source: Verify Code
tr: Kodu Doğrula

source: Code verified successfully
tr: Kod başarıyla doğrulandı

# voteRemoved
source: Vote removed successfully
tr: Oy kaldırıldı

source: Please log in to vote.
tr: Lütfen oy kullanmak için giriş yapın.

source: Comment upvoted!
tr: Yorum beğenildi!

source: Comment downvoted!
tr: Yorum beğenilmedi!

# voteFailed
source: Vote failed: {error}
tr: Oy başarısız: {error}

source: By {author}
tr: {author} tarafından

source: Delete Comment
tr: Yorumu Sil

source: Upvote
tr: Beğen

source: Downvote
tr: Beğenme

source: Post upvoted!
tr: Gönderi beğenildi!

source: Post downvoted!
tr: Gönderi beğenilmedi!

source: Report Post
tr: Gönderiyi Şikayet Et

# postFallback
source: Post
tr: Gönderi

source: Unknown
tr: Bilinmiyor

# totalTimeLabel
source: Total Time
tr: Toplam Süre

# minutesAbbr
source: mins
tr: dk

# costPerServingSuffix
source: per serving
tr: porsiyon başına

source: Recipe Image (Optional)
tr: Tarif Görseli (Opsiyonel)

source: Add Image
tr: Görsel Ekle

# failedToPickImage
source: Failed to pick image: {error}
tr: Görsel seçilemedi: {error}

# additionalInformationTitle
source: Additional Information
tr: Ek Bilgiler

source: Recipe not found.
tr: Tarif bulunamadı.

# reportLabel
source: Report
tr: Şikayet Et

# reportTypeSpamDescription
source: Unsolicited or repetitive content
tr: İstenmeyen veya tekrarlayan içerik

# reportTypeInappropriate
source: Inappropriate Content
tr: Uygunsuz İçerik

# reportTypeInappropriateDescription
source: Offensive or inappropriate material
tr: Saldırgan veya uygunsuz materyal

# reportTypeHarassment
source: Harassment
tr: Taciz

# reportTypeHarassmentDescription
source: Bullying or harassment
tr: Zorbalık veya taciz

# reportTypeOther
source: Other
tr: Diğer

# reportTypeOtherDescription
source: Other issues
tr: Diğer sorunlar

# reportSubmittedSuccess
source: Report submitted successfully. Thank you for your feedback.
tr: Şikayetiniz gönderildi. Geri bildiriminiz için teşekkürler.

# reportSubmitFailed
source: Failed to submit report: {error}
tr: Şikayet gönderilemedi: {error}

# recipeFallback
source: Recipe
tr: Tarif

# reportWhy
source: Why are you reporting this?
tr: Neden şikayet ediyorsunuz?

# reportAdditionalDetails
source: Additional details (optional)
tr: Ek detaylar (opsiyonel)

# reportAdditionalDetailsHint
source: Provide more information about this report...
tr: Bu şikayetle ilgili daha fazla bilgi verin...

source: Submit Report
tr: Şikayeti Gönder

source: Report this content
tr: Bu içeriği şikayet et

# deletePostTitle
source: Delete Post
tr: Gönderiyi Sil

# deletePostConfirmation
source: Are you sure you want to delete this post?
tr: Bu gönderiyi silmek istediğinize emin misiniz?

source: Delete
tr: Sil

source: Comment added!
tr: Yorum eklendi!

source: Comment deleted!
tr: Yorum silindi!

# errorTitle
source: Error
tr: Hata

source: Post not found
tr: Gönderi bulunamadı

source: Go Back
tr: Geri Dön

# postDetailTitle
source: Post Detail
tr: Gönderi Detayı

# createdLabel
source: Created:
tr: Oluşturulma:

# commentsTitle
source: Comments
tr: Yorumlar

# addCommentHint
source: Add a comment...
tr: Bir yorum ekle...

source: Error loading comments:
tr: Yorumlar yüklenirken hata oluştu:

# noCommentsYet
source: No comments yet. Be the first!
tr: Henüz yorum yok. İlk yorumu siz yapın!

# createPostTitle
source: Create Post
tr: Gönderi Oluştur

# postButton
source: Post
tr: Paylaş

# titleLabel
source: Title*
tr: Başlık*

# titleHelper
source: Maximum 255 characters
tr: Maksimum 255 karakter

# titleRequired
source: Title is required
tr: Başlık gerekli

# titleTooLong
source: Title must be less than 255 characters
tr: Başlık 255 karakterden az olmalıdır

# titleTooShort
source: Title must be at least 1 character
tr: Başlık en az 1 karakter olmalıdır

# contentLabel
source: Content*
tr: İçerik*

# contentHelper
source: Maximum 1000 characters
tr: Maksimum 1000 karakter

# contentRequired
source: Content is required
tr: İçerik gerekli

# contentTooLong
source: Content must be less than 1000 characters
tr: İçerik 1000 karakterden az olmalıdır

# contentTooShort
source: Content must be at least 1 character
tr: İçerik en az 1 karakter olmalıdır

source: Allow Comments
tr: Yorumlara izin ver

# postCreatedSuccess
source: Post created successfully
tr: Gönderi başarıyla oluşturuldu

# tagsLabel
source: Tags*
tr: Etiketler*

# selectedTagsLabel
source: Selected Tags:
tr: Seçilen Etiketler:

# tagBudget
source: Budget
tr: Bütçe

# tagMealPrep
source: Meal Prep
tr: Yemek Hazırlama

# tagFamily
source: Family
tr: Aile

# tagNoWaste
source: No Waste
tr: Sıfır Atık

# tagSustainability
source: Sustainability
tr: Sürdürülebilirlik

# tagTips
source: Tips
tr: İpuçları

# tagGlutenFree
source: Gluten Free
tr: Glutensiz

# tagVegetarian
source: Vegetarian
tr: Vejetaryen

# tagQuick
source: Quick
tr: Hızlı

# tagHealthy
source: Healthy
tr: Sağlıklı

# tagStudent
source: Student
tr: Öğrenci

# tagNutrition
source: Nutrition
tr: Beslenme

# tagHealthyEating
source: Healthy Eating
tr: Sağlıklı Beslenme

# tagSnacks
source: Snacks
tr: Atıştırmalıklar

# deleteCommentTitle
source: Delete Comment
tr: Yorumu Sil

# deleteCommentConfirmation
source: Are you sure you want to delete this comment?
tr: Bu yorumu silmek istediğinize emin misiniz?

# deleteCommentCancel
source: Cancel
tr: İptal

# deleteCommentDelete
source: Delete
tr: Sil

# failedToAddComment
source: Failed to add comment: {error}
tr: Yorum eklenemedi: {error}

# failedToDeleteComment
source: Failed to delete comment: {error}
tr: Yorum silinemedi: {error}

# editPostTitle
source: Edit Post
tr: Gönderiyi Düzenle

# saveButton
source: Save
tr: Kaydet

# pleaseAcceptTerms
source: Please accept the terms and conditions to continue.
tr: Lütfen şartları ve koşulları kabul edin.

# dietitianMustUploadPdf
source: Dietitians must upload a PDF certificate.
tr: Diyetisyenlerin PDF sertifikası yüklemesi gerekiyor.

# registrationSuccessfulCheckEmail
source: Registration successful! Please check your email to verify.
tr: Kayıt başarılı! Lütfen doğrulamak için e-postanızı kontrol edin.

# termsDialogContent
source: By using FitHub, you agree to the following terms: 1. Your personal information will be handled according to our privacy policy. 2. You are responsible for maintaining the confidentiality of your account. 3. You agree to use the platform responsibly and not engage in any harmful activities. 4. Dietitians must provide valid certification documents. 5. We reserve the right to terminate accounts that violate our terms.
tr: FitHub’u kullanarak, aşağıdaki şartları kabul ediyorsunuz: 1. Kişisel bilgileriniz gizlilik politikamıza göre işlenecektir. 2. Hesabınızın gizliliğini korumaktan siz sorumlusunuz. 3. Platformu sorumlu bir şekilde kullanmayı ve zararlı faaliyetlerde bulunmamayı kabul ediyorsunuz. 4. Diyetisyenler geçerli sertifika belgeleri sağlamalıdır. 5. Şartları ihlal eden hesapları sonlandırma hakkımız saklıdır.

source: Close
tr: Kapat

# passwordMustContainUppercase
source: Password must contain at least one uppercase letter
tr: Parola en az bir büyük harf içermelidir

# passwordMustContainLowercase
source: Password must contain at least one lowercase letter
tr: Parola en az bir küçük harf içermelidir

# passwordMustContainNumber
source: Password must contain at least one number
tr: Parola en az bir rakam içermelidir

# currencyUsd
source: US Dollar ($)
tr: ABD Doları ($)

# currencyTry
source: Turkish Lira (₺)
tr: Türk Lirası (₺)

# accessibilityNone
source: None
tr: Yok

# accessibilityColorblind
source: Colorblind
tr: Renk Körlüğü

# accessibilityVisual
source: Visual Impairment
tr: Görme Engeli

# accessibilityHearing
source: Hearing Impairment
tr: İşitme Engeli

# failedToObtainJwtTokens
source: Failed to obtain JWT tokens: {error}
tr: JWT tokenleri alınamadı: {error}

source: Meal Planner
tr: Öğün Planlayıcı

source: Plan Today
tr: Bugünü Planla

# browseAllRecipes
source: Browse All
tr: Tümüne Gözat

source: Shopping List
tr: Alışveriş Listesi

source: Generate Shopping List
tr: Alışveriş Listesi Oluştur

source: Filters
tr: Filtreler

source: Apply Filters
tr: Filtreleri Uygula

source: Reset Filters
tr: Filtreleri Sıfırla

source: Budget Range
tr: Bütçe Aralığı

source: Nutrition Filters
tr: Beslenme Filtreleri

source: Time Filters
tr: Süre Filtreleri

source: Rating Filters
tr: Puan Filtreleri

source: Additional Filters
tr: Ek Filtreler

# sortByLabel
source: Sort By
tr: Sıralama

# sortByBestMatch
source: Best Match
tr: En İyi Eşleşme

# sortByCostLowToHigh
source: Cost: Low to High
tr: Fiyat: Düşükten Yükseğe

# sortByCostHighToLow
source: Cost: High to Low
tr: Fiyat: Yüksekten Düşüğe

# sortByTimeLowToHigh
source: Time: Low to High
tr: Süre: Kısadan Uzuna

# sortByRating
source: Rating
tr: Puan

# caloriesLabel
source: Calories
tr: Kalori

# carbsLabel
source: Carbs
tr: Karbonhidrat

# fatLabel
source: Fat
tr: Yağ

# maxLabel
source: Max
tr: Maks

# totalTimeFilter
source: Total Time (minutes)
tr: Toplam Süre (dakika)

# prepTimeFilter
source: Prep Time (minutes)
tr: Hazırlık Süresi (dakika)

# cookTimeFilter
source: Cook Time (minutes)
tr: Pişirme Süresi (dakika)

# hasImageFilter
source: Has Image
tr: Resimli

# approvedOnlyFilter
source: Approved Only
tr: Sadece Onaylılar

# featuredOnlyFilter
source: Featured Only
tr: Sadece Öne Çıkanlar

# breakfastSection
source: Breakfast
tr: Kahvaltı

# lunchSection
source: Lunch
tr: Öğle Yemeği

# dinnerSection
source: Dinner
tr: Akşam Yemeği

source: Select Recipe
tr: Tarif Seç

source: Remove Recipe
tr: Tarifi Kaldır

source: Add to Meal Plan
tr: Yemek Planına Ekle

source: Remove from Meal Plan
tr: Yemek Planından Çıkar

source: Randomize
tr: Rastgele Seç

source: Total Daily Cost
tr: Günlük Toplam Maliyet

source: Total Cost
tr: Toplam Maliyet

source: Cost Breakdown
tr: Maliyet Dağılımı

source: Cheapest Option
tr: En Ucuz Seçenek

source: Ingredients List
tr: Malzeme Listesi

# noIngredientsInList
source: No ingredients in shopping list yet.
tr: Alışveriş listesinde henüz malzeme yok.

# addRecipesToGenerate
source: Add recipes to your meal plan to generate a shopping list.
tr: Alışveriş listesi oluşturmak için yemek planınıza tarifler ekleyin.

source: Share Shopping List
tr: Alışveriş Listesini Paylaş

source: Export Shopping List
tr: Alışveriş Listesini Dışa Aktar

source: Shopping list generated!
tr: Alışveriş listesi oluşturuldu!

source: Allergen Warning
tr: Alerjen Uyarısı

# allergenDetected
source: This recipe contains allergens you're sensitive to:
tr: Bu tarif, duyarlı olduğunuz alerjenleri içeriyor:

# allergenDetectedList
source: Allergens: {allergens}
tr: Alerjenler: {allergens}

source: Continue Anyway
tr: Yine de Devam Et

# allergenBadge
source: Contains Allergens
tr: Alerjen İçerir

# noRecipesForMealType
source: No recipes found for this meal type.
tr: Bu öğün tipi için tarif bulunamadı.

# tryAdjustingFilters
source: Try adjusting your filters.
tr: Filtrelerinizi ayarlamayı deneyin.

source: Loading recipes...
tr: Tarifler yükleniyor...

source: Select Meal Type
tr: Öğün Tipi Seç

source: All Meal Types
tr: Tüm Öğün Tipleri

# recipeAddedToPlan
source: Recipe added to meal plan
tr: Tarif yemek planına eklendi

# recipeRemovedFromPlan
source: Recipe removed from meal plan
tr: Tarif yemek planından çıkarıldı

source: Budget Exceeded
tr: Bütçe Aşıldı

# totalCostExceedsBudget
source: Total cost exceeds your monthly budget.
tr: Toplam maliyet aylık bütçenizi aşıyor.

source: Within Budget
tr: Bütçe Dahilinde

# comparedToMonthlyBudget
source: Compared to your monthly budget: {budget}
tr: Aylık bütçenizle karşılaştırma: {budget}

source: No meal plan yet.
tr: Henüz yemek planı yok.

# startBySelectingRecipes
source: Start by selecting recipes for each meal.
tr: Her öğün için tarifler seçerek başlayın.

source: Meal Plan Summary
tr: Yemek Planı Özeti

# recipesSelected
source: {count} recipes selected
tr: {count} tarif seçildi

# servingsLabel
source: Servings
tr: Porsiyon

source: per serving
tr: porsiyon başına

source: Check All
tr: Tümünü İşaretle

source: Uncheck All
tr: Tümünü Kaldır

# checkedItems
source: {count} of {total} items checked
tr: {total} öğenin {count} tanesi işaretlendi

source: Filter by Meal Type
tr: Öğün Tipine Göre Filtrele

# difficultyRatingLabel
source: Difficulty Rating
tr: Zorluk Puanı
